// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a = prompt();
// let b = prompt();
// if (a > b) {
//     console.log("максимальне перше число");
// } else if (a === b) {
//     console.log('Введенні рівні числа');
// }else if (a < b) {
//     console.log('максимальне друге число');
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let Entrance = +prompt('');
// if (Entrance === 0 || Entrance <= 20) {
//     console.log('OneEntrance')
// }else if (Entrance > 20 && Entrance <= 48) {
//     console.log('TwoEntrance')
// }else if (Entrance > 49 && Entrance <= 90) {
//     console.log('ThreeEntrance')
// }
//






// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10
// вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('');
// if (number === 10) {
//     console.log('Вірно');
// } else {
//     console.log('Не вірно')
// }




//
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


// let value = 'hello';
// if (typeof value ==='number') {
//    console.log('1')
// }else if (typeof value === 'string') {
//     console.log('2')
// }else if (typeof value === 'boolean') {
//     console.log('-3')
// }else if (typeof value === 'object') {
//     console.log('-3')
// }else if (typeof value === '[]') {
//     console.log('-3')
// } else {
//     console.log('Введенні не правильні значення')
// }






// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22
//     вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
// let okten = +prompt();
// if (okten >= 10 && okten <= 22) {
//     alert('Ми йдемо ВЧИТИСЯ');
// } else {
//     alert('Ми сидимо вдома і вчимося ОНЛАЙН');
// }




//
// - За допомогою switch case - реалізувати гру - вікторину,
// де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д )
//     і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let prize= +prompt();
// switch (prize) {
//     case 1:
//         console.log("Ви виграли авто!!!");
//         break;
//     case 2:
//         console.log("Ви виграли мото");
//         break;
//     case 3:
//         console.log("Ви виграли телефон");
//         break;
//     case 4:
//         console.log("Ви виграли квартиру");
//         break;
//     case 5:
//         console.log("Ви виграли мільйон");
//         break;
//     default:
//         console.log("Це число не вірне")
// }