
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3,
// то виводиться повідомлення про те, що це великий масив,
//в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends[0,1,2]>=[2]) {
//     console.log('Великий масив');
// } else {
//     console.log('Маленкий масив');
// }



// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше).
//     Перевірити, чи знаходиться перше число між двома іншими.
//
// - Перепишіть конструкцію if з використанням умовного оператора '?':




// let a = prompt();
// let b = prompt();
// let c = prompt();
//
// if (a > b && a > c) {
//
//
// } else {
//     result = 'Багато';
// }
//




// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число:
// позитивним, негативним або нулем
// напишіть це тернарним оператором


// let p =10
// let k= p > -100 && p<-1? "Негативне значення" : "Позитивне";
// console.log(k)
// let c = p === 0 ? "Нуль" : " ";
// console.log(c);
//




